data/raw_bench/2200_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.520ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.520ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.518ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.518ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   514.03us  101.36us 819.00us   76.73%
    Req/Sec   580.70    250.35     1.22k    70.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  498.00us
 75.000%  563.00us
 90.000%  634.00us
 99.000%  819.00us
 99.900%    1.15ms
 99.990%    2.22ms
 99.999%    3.19ms
100.000%    3.19ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.287     0.000000            1         1.00
       0.410     0.100000         4466         1.11
       0.437     0.200000         8911         1.25
       0.458     0.300000        13317         1.43
       0.477     0.400000        17689         1.67
       0.498     0.500000        22161         2.00
       0.508     0.550000        24209         2.22
       0.520     0.600000        26503         2.50
       0.533     0.650000        28720         2.86
       0.547     0.700000        30896         3.33
       0.563     0.750000        33085         4.00
       0.572     0.775000        34118         4.44
       0.581     0.800000        35171         5.00
       0.592     0.825000        36292         5.71
       0.604     0.850000        37413         6.67
       0.618     0.875000        38487         8.00
       0.626     0.887500        39067         8.89
       0.634     0.900000        39580        10.00
       0.644     0.912500        40132        11.43
       0.656     0.925000        40701        13.33
       0.669     0.937500        41239        16.00
       0.676     0.943750        41498        17.78
       0.684     0.950000        41774        20.00
       0.694     0.956250        42056        22.86
       0.706     0.962500        42333        26.67
       0.718     0.968750        42599        32.00
       0.725     0.971875        42723        35.56
       0.735     0.975000        42871        40.00
       0.745     0.978125        42997        45.71
       0.757     0.981250        43137        53.33
       0.774     0.984375        43275        64.00
       0.784     0.985938        43344        71.11
       0.795     0.987500        43406        80.00
       0.811     0.989062        43481        91.43
       0.829     0.990625        43552       106.67
       0.855     0.992188        43613       128.00
       0.871     0.992969        43646       142.22
       0.888     0.993750        43681       160.00
       0.908     0.994531        43718       182.86
       0.926     0.995313        43749       213.33
       0.953     0.996094        43784       256.00
       0.966     0.996484        43801       284.44
       0.983     0.996875        43818       320.00
       0.997     0.997266        43835       365.71
       1.020     0.997656        43853       426.67
       1.037     0.998047        43870       512.00
       1.055     0.998242        43878       568.89
       1.075     0.998437        43887       640.00
       1.094     0.998633        43895       731.43
       1.136     0.998828        43904       853.33
       1.155     0.999023        43914      1024.00
       1.170     0.999121        43917      1137.78
       1.203     0.999219        43921      1280.00
       1.240     0.999316        43925      1462.86
       1.275     0.999414        43930      1706.67
       1.299     0.999512        43934      2048.00
       1.353     0.999561        43936      2275.56
       1.399     0.999609        43938      2560.00
       1.466     0.999658        43940      2925.71
       1.520     0.999707        43944      3413.33
       1.646     0.999756        43945      4096.00
       1.662     0.999780        43946      4551.11
       1.827     0.999805        43947      5120.00
       2.105     0.999829        43948      5851.43
       2.197     0.999854        43949      6826.67
       2.209     0.999878        43950      8192.00
       2.225     0.999890        43951      9102.22
       2.225     0.999902        43951     10240.00
       2.873     0.999915        43952     11702.86
       2.873     0.999927        43952     13653.33
       2.875     0.999939        43953     16384.00
       2.875     0.999945        43953     18204.44
       2.875     0.999951        43953     20480.00
       2.939     0.999957        43954     23405.71
       2.939     0.999963        43954     27306.67
       2.939     0.999969        43954     32768.00
       2.939     0.999973        43954     36408.89
       2.939     0.999976        43954     40960.00
       3.187     0.999979        43955     46811.43
       3.187     1.000000        43955          inf
#[Mean    =        0.514, StdDeviation   =        0.101]
#[Max     =        3.186, Total count    =        43955]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  65820 requests in 30.00s, 12.49MB read
Requests/sec:   2193.70  
Transfer/sec:    426.32KB