data/raw_bench/300_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.607ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.602ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.634ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.604ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   615.78us  396.41us   0.88ms   99.65%
    Req/Sec    79.39     91.14   333.00     83.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  606.00us
 75.000%  672.00us
 90.000%  744.00us
 99.000%    0.88ms
 99.900%    1.34ms
 99.990%    1.71ms
 99.999%   30.06ms
100.000%   30.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.341     0.000000            1         1.00
       0.482     0.100000          604         1.11
       0.519     0.200000         1193         1.25
       0.552     0.300000         1786         1.43
       0.580     0.400000         2397         1.67
       0.606     0.500000         2974         2.00
       0.619     0.550000         3291         2.22
       0.632     0.600000         3569         2.50
       0.644     0.650000         3880         2.86
       0.658     0.700000         4173         3.33
       0.672     0.750000         4459         4.00
       0.681     0.775000         4617         4.44
       0.690     0.800000         4760         5.00
       0.702     0.825000         4915         5.71
       0.715     0.850000         5052         6.67
       0.730     0.875000         5199         8.00
       0.738     0.887500         5289         8.89
       0.744     0.900000         5350        10.00
       0.753     0.912500         5430        11.43
       0.762     0.925000         5498        13.33
       0.772     0.937500         5571        16.00
       0.777     0.943750         5611        17.78
       0.784     0.950000         5648        20.00
       0.790     0.956250         5684        22.86
       0.798     0.962500         5724        26.67
       0.807     0.968750         5756        32.00
       0.813     0.971875         5777        35.56
       0.818     0.975000         5794        40.00
       0.827     0.978125         5815        45.71
       0.838     0.981250         5831        53.33
       0.853     0.984375         5851        64.00
       0.859     0.985938         5858        71.11
       0.865     0.987500         5868        80.00
       0.871     0.989062         5878        91.43
       0.878     0.990625         5887       106.67
       0.891     0.992188         5895       128.00
       0.894     0.992969         5900       142.22
       0.917     0.993750         5904       160.00
       0.929     0.994531         5909       182.86
       0.956     0.995313         5914       213.33
       0.989     0.996094         5918       256.00
       1.023     0.996484         5921       284.44
       1.064     0.996875         5923       320.00
       1.104     0.997266         5925       365.71
       1.131     0.997656         5928       426.67
       1.195     0.998047         5930       512.00
       1.236     0.998242         5931       568.89
       1.249     0.998437         5932       640.00
       1.328     0.998633         5933       731.43
       1.340     0.998828         5935       853.33
       1.348     0.999023         5936      1024.00
       1.348     0.999121         5936      1137.78
       1.363     0.999219         5937      1280.00
       1.363     0.999316         5937      1462.86
       1.424     0.999414         5938      1706.67
       1.439     0.999512         5939      2048.00
       1.439     0.999561         5939      2275.56
       1.439     0.999609         5939      2560.00
       1.439     0.999658         5939      2925.71
       1.710     0.999707         5940      3413.33
       1.710     0.999756         5940      4096.00
       1.710     0.999780         5940      4551.11
       1.710     0.999805         5940      5120.00
       1.710     0.999829         5940      5851.43
      30.063     0.999854         5941      6826.67
      30.063     1.000000         5941          inf
#[Mean    =        0.616, StdDeviation   =        0.396]
#[Max     =       30.048, Total count    =         5941]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  8958 requests in 30.02s, 1.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 587
Requests/sec:    298.40  
Transfer/sec:     57.99KB