data/raw_bench/400_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.595ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.637ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.605ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.596ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   598.17us  104.31us   0.87ms   69.91%
    Req/Sec   105.30    104.70   400.00     83.74%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  592.00us
 75.000%  661.00us
 90.000%  731.00us
 99.000%    0.87ms
 99.900%    1.21ms
 99.990%    1.41ms
 99.999%    1.41ms
100.000%    1.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.360     0.000000            1         1.00
       0.473     0.100000          809         1.11
       0.506     0.200000         1595         1.25
       0.536     0.300000         2395         1.43
       0.565     0.400000         3172         1.67
       0.592     0.500000         3974         2.00
       0.604     0.550000         4359         2.22
       0.617     0.600000         4743         2.50
       0.631     0.650000         5161         2.86
       0.645     0.700000         5535         3.33
       0.661     0.750000         5931         4.00
       0.670     0.775000         6129         4.44
       0.679     0.800000         6324         5.00
       0.691     0.825000         6535         5.71
       0.702     0.850000         6732         6.67
       0.715     0.875000         6922         8.00
       0.723     0.887500         7020         8.89
       0.731     0.900000         7128        10.00
       0.739     0.912500         7213        11.43
       0.750     0.925000         7314        13.33
       0.761     0.937500         7416        16.00
       0.767     0.943750         7464        17.78
       0.774     0.950000         7511        20.00
       0.784     0.956250         7564        22.86
       0.791     0.962500         7607        26.67
       0.801     0.968750         7659        32.00
       0.808     0.971875         7683        35.56
       0.814     0.975000         7707        40.00
       0.823     0.978125         7732        45.71
       0.833     0.981250         7756        53.33
       0.844     0.984375         7780        64.00
       0.849     0.985938         7792        71.11
       0.859     0.987500         7806        80.00
       0.866     0.989062         7817        91.43
       0.876     0.990625         7829       106.67
       0.891     0.992188         7843       128.00
       0.898     0.992969         7849       142.22
       0.903     0.993750         7855       160.00
       0.906     0.994531         7860       182.86
       0.933     0.995313         7866       213.33
       0.963     0.996094         7873       256.00
       0.971     0.996484         7876       284.44
       0.982     0.996875         7879       320.00
       1.013     0.997266         7882       365.71
       1.031     0.997656         7885       426.67
       1.095     0.998047         7888       512.00
       1.111     0.998242         7890       568.89
       1.116     0.998437         7891       640.00
       1.143     0.998633         7893       731.43
       1.166     0.998828         7894       853.33
       1.218     0.999023         7896      1024.00
       1.273     0.999121         7897      1137.78
       1.273     0.999219         7897      1280.00
       1.358     0.999316         7898      1462.86
       1.361     0.999414         7899      1706.67
       1.380     0.999512         7900      2048.00
       1.380     0.999561         7900      2275.56
       1.380     0.999609         7900      2560.00
       1.391     0.999658         7901      2925.71
       1.391     0.999707         7901      3413.33
       1.413     0.999756         7902      4096.00
       1.413     0.999780         7902      4551.11
       1.413     0.999805         7902      5120.00
       1.413     0.999829         7902      5851.43
       1.413     0.999854         7902      6826.67
       1.415     0.999878         7903      8192.00
       1.415     1.000000         7903          inf
#[Mean    =        0.598, StdDeviation   =        0.104]
#[Max     =        1.415, Total count    =         7903]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  11802 requests in 30.01s, 2.24MB read
  Socket errors: connect 0, read 0, write 0, timeout 373
Requests/sec:    393.28  
Transfer/sec:     76.43KB